""" 
                                        Вступ

                                        Привіт!
    У цьому модулі ми вивчимо деякі вбудовані модулі, а також структури даних і основи функціонального
програмування у Python.
    Розглянемо такі теми:
        - використання іменованих кортежів та спеціальних словників Counter та defaultdict у модулі 
        collections
        - принципи роботи структур даних стек, черга та двостороння черга
        - забезпечення точності обчислення дробів за допомогою модуля decimal
        - створення генераторів для лінивої (on-demand) генерації даних
        - концепції замикання та карування
        - основи функціонального програмування в Python
        - розширення можливостей функцій за допомогою використання декораторів
        -швидке заповнення списків, множин та словників за допомогою конструкцій comprehensions
        -використання лямбда-функцій, а також функцій map, filter, any та all.
    В результаті проходження модуля, ви значно розширете свій інструментарій та навчитесь вирішувати 
нові задачі у Python.

                                        Можливості деяких вбудованих модулів Python

                        Модуль collections
                                                                               
    У Python є пакет з додатковими колекціями, які можуть дуже знадобитися розробнику-початківцю і 
    значно розширити його арсенал. Модуль collections в Python - це вбудований модуль, який містить 
    спеціалізовані типи даних, які надають альтернативи стандартним вбудованим контейнерам. Ці 
    спеціалізовані типи даних призначені для вирішення конкретних задач програмування.


"""